import numpy as np

# a - вектор-стовпець, чи вектор-рядок?:
a = np.array([1, 2, 3, 4, 5], dtype=float)
print(a)  # [1. 2. 3. 4. 5.]
print(a.shape)  # (5,) - за конспектом: 'наче це таблиця з 5-ма рядочками, ну і без стовпців'
# як це без стовпців? ... якщо одні рядки, то
# значить `a` - вектор-стовпець
print(b := a.reshape(1, 5))  # [[1. 2. 3. 4. 5.]]
print(b.shape)  # (1,5) - 1 рядок, 5 стовпців
# значить `b` - вектор-рядок
c = np.array([[1], [2], [3], [4], [5]], dtype=float)
print(c)
print(c.shape)  # (5, 1) - 5 рядків і 1 стовпець
# То таки `c` - вектор-стовпець? чи виділямо окремо матрицю з 1 стовпцем що не є ветором-стовпцем?
# об'єкти різні, але з математичної точки зору `a` та `c` - однакові?
print(d := a.reshape(5, 1))  # [[1.], [2.], [3.], [4.], [5.]]
print(d.shape)  # (5, 1)
# а от зробити так, щоб .shape видавав стовпці без рядків (, 5) - ніяк?
